<a href="https://colab.research.google.com/github/CVanchieri/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/JoinandReshapeData_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment

## Join Data Section

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
# we can use !wget to gt the file.
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
  
# use !tar code to unzip a .tar file.
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

# we can see directory the files are stored in.
%cd instacart_2017_05_01

# list out all the .csv files.
!ls -lh *.csv

--2019-07-31 19:56:07--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.32.246
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.32.246|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.4’

instacart_online_gr 100%[===================>] 196.03M  45.9MB/s    in 4.7s

2019-07-31 19:56:12 (42.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.4’ saved [205548478/205548478]

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv
/content/instacart_2017_05_01
-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
# import pandas library to load the data sets.
import pandas as pd

In [0]:
# label the data set and load with pd.read_csv().
order_products__prior = pd.read_csv('order_products__prior.csv')

# show the shape of the data frame.
print(order_products__prior.shape)

# show the data set with headers.
order_products__prior.head(1)

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1

In [0]:
# label the data set and load with pd.read_csv().
order_products__train = pd.read_csv('order_products__train.csv')

# show the shape of the data frame.
print(order_products__train.shape)

# show the data set with headers.
order_products__train.head(1)

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1

In [0]:
# both these data sets havce the same column names so we will merge all columns of the data sets.
# label the new data set amd use pd.concat() to merge them.
order_products = pd.concat([order_products__prior, order_products__train])

# show the shape of the data set.
print(order_products.shape)

# show the data set with headers.
order_products.head(1)

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1

In [0]:
# label the data set and load with pd.read_csv().
orders = pd.read_csv('orders.csv')

# show the shape of the data frame.
print(orders.shape)

# show the data set with headers.
orders.head(1)

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN

[1 rows x 7 columns]

In [0]:
# label the new data and use pd.merge with 'order_products' data set with 'orders' data set and use columns 'order_id' & 'order_number'
order_merged = pd.merge(order_products, orders[['order_id', 'order_number']], how='left', on='order_id')

# show the data set with headers.
order_merged.head(1)

   order_id  product_id  add_to_cart_order  reordered  order_number
0         2       33120                  1          1             3

In [0]:
# label the data set and load with pd.read_csv().
products = pd.read_csv('products.csv')

# show the shape of the data frame.
print(products.shape)

# show the data set with headers.
products.head(1)

(49688, 4)

   product_id                product_name  aisle_id  department_id
0           1  Chocolate Sandwich Cookies        61             19

In [0]:
# label the new data and use pd.merge with 'order_merged' data set with 'products' data set and use columns 'product_id' & 'product_name'.
orders_products = pd.merge(order_merged, products[['product_id','product_name']], how='left', on='product_id')

# show the data set with headers.
orders_products.head(1)

   order_id  product_id  ...  order_number        product_name
0         2       33120  ...             3  Organic Egg Whites

[1 rows x 6 columns]

In [0]:
# drop the columns we are not interested in.
final = orders_products.drop(['product_id', 'reordered', 'add_to_cart_order'], axis=1)

# show the data set with the headers.
final.head(1)

   order_id  order_number        product_name
0         2             3  Organic Egg Whites

In [0]:
# Label and create a data set with the product names we are interested in.
product_names = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']

In [0]:
# create a condition that gives a a true or false if the value is in the list of product names we listed above.
condition = ((final['product_name'] == product_names[0]) |
             (final['product_name'] == product_names[1]))

# Other approach that works
condition = final['product_name'].isin(product_names)

# show the data list of false/true.
condition

0           False
1           False
2           False
3           False
4           False
5           False
6           False
7           False
8           False
9           False
10          False
11          False
12           True
13          False
14          False
15          False
16          False
17          False
18          False
19          False
20          False
21          False
22          False
23          False
24          False
25          False
26          False
27          False
28          False
29          False
            ...
33819076    False
33819077    False
33819078    False
33819079    False
33819080    False
33819081    False
33819082    False
33819083    False
33819084    False
33819085    False
33819086    False
33819087    False
33819088    False
33819089    False
33819090    False
33819091    False
33819092    False
33819093    False
33819094    False
33819095    False
33819096    False
33819097    False
33819098    False
33819099    False
33819100    False
33819101    False
33819102    False
33819103    False
33819104    False
33819105    False
Name: product_name, Length: 33819106, dtype: bool

In [0]:
# label and create a data set of the 'final' data using the condition above.
subset = final[condition]

# show the data set headers.
subset.head()

    order_id  order_number            product_name
12         3            16    Organic Baby Spinach
30         5            42  Bag of Organic Bananas
51         5            42    Organic Hass Avocado
77        10             4                  Banana
80        10             4         Organic Avocado

In [0]:
# we can not see the total values for each product in our data set.
subset['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [0]:
# we can also look at some statistics of the data set.
subset['product_name'].describe()

count     2418314
unique         10
top        Banana
freq       491291
Name: product_name, dtype: object

In [0]:
# label and create a new 'tidy' data set useing .melt.
tidy = subset.melt(id_vars='product_name')

# show the 'tidy' data set.
tidy

                   product_name      variable  value
0          Organic Baby Spinach      order_id      3
1        Bag of Organic Bananas      order_id      5
2          Organic Hass Avocado      order_id      5
3                        Banana      order_id     10
4               Organic Avocado      order_id     10
5          Organic Strawberries      order_id     10
6            Organic Whole Milk      order_id     14
7               Organic Avocado      order_id     18
8                        Banana      order_id     20
9                        Banana      order_id     22
10              Organic Avocado      order_id     23
11                       Banana      order_id     26
12         Organic Baby Spinach      order_id     26
13              Organic Avocado      order_id     26
14       Bag of Organic Bananas      order_id     27
15              Organic Avocado      order_id     27
16                  Large Lemon      order_id     28
17         Organic Hass Avocado      order_id     28
18       Bag of Organic Bananas      order_id     29
19         Organic Baby Spinach      order_id     31
20       Bag of Organic Bananas      order_id     32
21         Organic Baby Spinach      order_id     39
22       Bag of Organic Bananas      order_id     42
23                 Strawberries      order_id     47
24                       Banana      order_id     52
25                       Banana      order_id     53
26         Organic Hass Avocado      order_id     53
27                  Large Lemon      order_id     53
28                       Banana      order_id     54
29       Bag of Organic Bananas      order_id     55
...                         ...           ...    ...
4836598  Bag of Organic Bananas  order_number      5
4836599         Organic Avocado  order_number     16
4836600             Large Lemon  order_number     35
4836601         Organic Avocado  order_number     35
4836602                   Limes  order_number     35
4836603    Organic Strawberries  order_number     35
4836604    Organic Strawberries  order_number     67
4836605  Bag of Organic Bananas  order_number     67
4836606  Bag of Organic Bananas  order_number      7
4836607    Organic Hass Avocado  order_number      7
4836608                   Limes  order_number      7
4836609  Bag of Organic Bananas  order_number     19
4836610            Strawberries  order_number     19
4836611         Organic Avocado  order_number      6
4836612            Strawberries  order_number     15
4836613  Bag of Organic Bananas  order_number      5
4836614    Organic Hass Avocado  order_number     15
4836615  Bag of Organic Bananas  order_number     79
4836616      Organic Whole Milk  order_number     79
4836617    Organic Baby Spinach  order_number     14
4836618  Bag of Organic Bananas  order_number     14
4836619         Organic Avocado  order_number     14
4836620      Organic Whole Milk  order_number     10
4836621    Organic Baby Spinach  order_number     10
4836622  Bag of Organic Bananas  order_number     10
4836623             Large Lemon  order_number      7
4836624    Organic Strawberries  order_number     31
4836625                  Banana  order_number     16
4836626    Organic Strawberries  order_number     25
4836627    Organic Baby Spinach  order_number     25

[4836628 rows x 3 columns]

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# import all the libraries we are using.
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns


# create our own data set.
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

# table2 is the transverse of table1.
table2 = table1.T

In [0]:
# show the data set table 1.
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
# we can reset the table1 to the original with .reset_index().
table1 = table1.reset_index()

# show the data set table1 with reset.
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [0]:
# change table1 into a 'tidy'.

# label the data set and use .met(id_vars='index') to met into 'tidy' format.
tidy = table1.melt(id_vars='index')

# show the tidy data set.
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [0]:
# we can rename the columns in the tidy data set.
tidy = tidy.rename(columns={'index': 'name', 'variable': 'trt', 'value': 'result'})

# we can remove the 'treatment' text from the 'trt' column.
tidy['trt'] = tidy.trt.str.replace('treatment','')

# show the tidy data set with new names and values.
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [0]:
# change tidy back to the table1.

# label the data set and use.pivot_table().
wide = tidy.pivot_table(values='result', index='name', columns='trt')

# show the table1 data set.
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [0]:
# show the data set table2.
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
# we can reset the table2 to the original with .reset_index().
table2 = table2.reset_index()

# show the data set table1 with reset.
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
# change table2 to a 'tidy'.

# label the data set and use .met(id_vars='index') to met into 'tidy' format.
tidy2 = table2.melt(id_vars='index')

# show the tidy data set.
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
# we can rename the columns in the tidy2 data set.
tidy2 = tidy2.rename(columns={'index': 'trt', 'variable': 'name', 'value': 'result'})

# we can remove the 'treatment' text from the 'trt' column.
tidy2['trt'] = tidy2.trt.str.replace('treatment','')

# show the tidy data set with new names and values.
tidy2

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [0]:
# change tidy2 back to the table2.

# label the data set and use.pivot_table().
wide2 = tidy2.pivot_table(values='result', index='name', columns='trt')

# show the table1 data set.
wide2

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [0]:
# label and load the data set with sns.load_dataset.
flights = sns.load_dataset('flights')

# show the data set and headers.
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
# label the data set and use.pivot_table() on 'flights'.
flights2 = flights.pivot_table(values='passengers', index='year', columns='month')

# show the flights2 data set.
flights2

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
# label the data set and load with pd.read_csv().
order_products__prior = pd.read_csv('order_products__prior.csv')

# show the shape of the data frame.
print(order_products__prior.shape)

# show the data set with headers.
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# label the data set and load with pd.read_csv().
order_products__train = pd.read_csv('order_products__train.csv')

# show the shape of the data frame.
print(order_products__train.shape)

# show the data set with headers.
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
# label the data set and load with pd.read_csv().
orders = pd.read_csv('orders.csv')

# show the shape of the data frame.
print(orders.shape)

# show the data set with headers.
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [0]:
# label the data set and load with pd.read_csv().
products = pd.read_csv('products.csv')

# show the shape of the data frame.
print(products.shape)

# show the data set with headers.
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

## Concatenate order_products__prior and order_products__train

In [0]:
# both these data sets havce the same column names so we will merge all columns of the data sets.
# label the new data set amd use pd.concat() to merge them.
order_products = pd.concat([order_products__prior, order_products__train])

# show the shape of the data set.
print(order_products.shape)

# show the data set with headers.
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

![alt text](https://)## Set  'orders' data frame with the columns we want.

from `orders` dataframe:
- user_id
- order_id
- order_number
- order_dow
- order_hour_of_day

In [0]:
# we first set the columns we want to use that were listed above.
columns = ['order_id','user_id','order_number', 'order_dow','order_hour_of_day']

orders = orders[columns]

orders.head()

   order_id  user_id  order_number  order_dow  order_hour_of_day
0   2539329        1             1          2                  8
1   2398795        1             2          3                  7
2    473747        1             3          3                 12
3   2254736        1             4          4                  7
4    431534        1             5          4                 15

## Merge dataframes order_products & orders.

In [0]:
# label the merged data set and use pd.merge with the 2 data sets and the columns of set we are adding to the subset.
merged = pd.merge(orders, order_products[['order_id','product_id']], how='left', on='order_id')

# show the new merged data set.
merged.head()

   order_id  user_id  order_number  order_dow  order_hour_of_day  product_id
0   2539329        1             1          2                  8       196.0
1   2539329        1             1          2                  8     14084.0
2   2539329        1             1          2                  8     12427.0
3   2539329        1             1          2                  8     26088.0
4   2539329        1             1          2                  8     26405.0

##Merge 'merged' data set with the 'products' data set.

In [0]:
# show the dat set headers.
products.head(1)

   product_id                product_name  aisle_id  department_id
0           1  Chocolate Sandwich Cookies        61             19

In [0]:
# label the merged data set and use pd.merge with the 2 data sets and the columns of set we are adding to the subset.
final = pd.merge(merged, products[['product_id','product_name']], how='left', on='product_id')

# show the merged data set with headers.
final.head()

   order_id  user_id  ...  product_id                             product_name
0   2539329        1  ...       196.0                                     Soda
1   2539329        1  ...     14084.0  Organic Unsweetened Vanilla Almond Milk
2   2539329        1  ...     12427.0                      Original Beef Jerky
3   2539329        1  ...     26088.0               Aged White Cheddar Popcorn
4   2539329        1  ...     26405.0         XL Pick-A-Size Paper Towel Rolls

[5 rows x 7 columns]

In [0]:
columns = ['order_hour_of_day']

condition = (final.order_hour_of_day == 23) & (final.product_name)

final2 = final.loc[condition, columns]

final2

NameError: ignored